The  IPrintSetting  type exposes the following members.
 Properties
Name  |   Description
PrintParameters
 Returns the Parameters of Print Setup.
 See Also
  IPrintSetting Interface
  Autodesk.Revit.DB Namespace